{
  "backend/main.mo": "Main actor for the Student Budget Manager ICP canister, defining data types (profiles, wallets, KYC, transactions) and exposing public query/update methods for user profiles, budget allocation, expenses, savings goals, and wallet operations with access control.",
  "backend/migration.mo": "Migration module that handles canister upgrade state transformation, specifically adding an empty wallets map to the existing actor state that previously only contained profiles.",
  "feature_evidence.json": "Feature evidence report listing implemented features with their associated files, components, test IDs, and confidence levels, covering wallet React Query hooks, Wallet screen UI, and KYC flow.",
  "frontend-file-summaries.txt": "JSON document summarizing each frontend source file's purpose and contents, serving as a reference for the frontend codebase structure including all components, hooks, and styles.",
  "frontend/index.css": "Global CSS file setting up Tailwind directives and defining OKLCH-based CSS custom property color tokens for both light and dark themes, covering background, foreground, chart, and sidebar variables.",
  "frontend/index.html": "Minimal HTML entry point for the React app titled 'Student Budget Manager', mounting the app into a root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React application file that configures TanStack Router with eight routes (dashboard, onboarding, expenses, goals, invest, calculator, wallet, admin), wraps protected routes in an AuthGuard that checks Internet Identity and user profile, and provides theme and toast context.",
  "frontend/src/components/AdminPanel.tsx": "Admin panel component that fetches and displays all wallet summaries in a table, showing system stats (total users, balances) and per-user KYC status with unauthorized access handling.",
  "frontend/src/components/BalanceCard.tsx": "Reusable card component that displays a financial balance (spending, saving, or investing) with a gradient background, icon, optional lock status, and INR formatting.",
  "frontend/src/components/BottomNavigation.tsx": "Fixed bottom navigation bar with six tabs (Home, Expenses, Goals, Invest, Calc, Wallet) that highlights the active route using TanStack Router.",
  "frontend/src/components/BudgetCalculator.tsx": "Interactive budget calculator that lets users input monthly income and adjust spending/saving/investing percentages via sliders, showing real-time INR breakdowns without persisting data.",
  "frontend/src/components/ComplianceNotice.tsx": "Collapsible legal disclaimer component that discloses the app's simulated wallet nature, RBI licensing requirements, KYC data handling, and age restrictions.",
  "frontend/src/components/Dashboard.tsx": "Main dashboard screen that displays income allocation balance cards, recent expenses, wallet balance, and locker status, with a setup prompt for new users and logout functionality.",
  "frontend/src/components/ExpenseTracker.tsx": "Expense tracking page that shows a monthly budget progress bar, an inline add-expense form with category selection, and expenses grouped by date fetched from the backend.",
  "frontend/src/components/GoalCard.tsx": "Renders a savings goal card with progress bar, top-up input, and unlock functionality, displaying deadline countdown and locked/open status.",
  "frontend/src/components/InvestmentCard.tsx": "Displays a single investment option card showing name, risk level, return range, minimum monthly amount, and optional user allocation.",
  "frontend/src/components/InvestmentSuggestions.tsx": "Shows a list of static low-risk investment suggestions (RD, PPF, Index Fund) with the user's monthly investment budget and a projection table.",
  "frontend/src/components/KYCFlow.tsx": "Provides a multi-step KYC verification UI with forms for basic (Aadhaar last 4 digits, phone, DOB) and full KYC submission, showing current status and transaction limits.",
  "frontend/src/components/Layout.tsx": "Wraps page content with a full-screen container and conditionally renders the bottom navigation bar when the user is authenticated.",
  "frontend/src/components/LoginPage.tsx": "Displays the app's landing/login page with feature highlights and an Internet Identity login button.",
  "frontend/src/components/OnboardingScreen.tsx": "Multi-field onboarding form that collects income sources and spending/saving/investing allocation percentages, then saves them to the backend before redirecting to the dashboard.",
  "frontend/src/components/PINPad.tsx": "A 4-digit PIN entry component with a numeric keypad and dot indicators that calls `onComplete` when all 4 digits are entered.",
  "frontend/src/components/ProfileSetup.tsx": "A onboarding form that collects the user's display name and saves it via the `useSaveCallerUserProfile` mutation.",
  "frontend/src/components/ProjectionTable.tsx": "Displays a table of SIP/investment growth projections for 1, 3, and 5 years using a future-value compound interest formula.",
  "frontend/src/components/QRScannerModal.tsx": "Empty file with no content.",
  "frontend/src/components/ReceiveMoneyModal.tsx": "Empty file with no content.",
  "frontend/src/components/SavingsGoalTracker.tsx": "Displays savings goals with a creation form and shows the digital locker lock/unlock status; uses hooks to fetch and add goals.",
  "frontend/src/components/SendMoneyForm.tsx": "Empty file with no content.",
  "frontend/src/components/TransactionListItem.tsx": "Empty file with no content.",
  "frontend/src/components/Wallet.tsx": "Main wallet UI component that shows balance, transaction history grouped by date, and actions like add funds, deduct, and locker transfer, with PIN setup/verify and KYC flows.",
  "frontend/src/components/WalletPINSetup.tsx": "Two-step PIN creation flow (enter then confirm) that calls `useSetWalletPIN` to persist the PIN on success.",
  "frontend/src/components/WalletPINVerify.tsx": "PIN verification screen that calls `useVerifyWalletPIN` and invokes `onVerified` if the entered PIN is correct.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Defines TanStack Query hooks for all backend actor interactions including user profiles, expenses, savings goals, wallet, KYC, and transactions with cache invalidation on mutations.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind layers, and defines CSS custom properties for a teal/green-themed design system with light and dark mode variants.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/dateGrouping.ts": "Utility that sorts and groups an array of Expense objects into labeled date buckets (Today, Yesterday, or formatted date strings).",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that maps CSS custom properties to semantic color tokens, constrains container width to 430px for a mobile-first layout, and registers animation/typography plugins.",
  "project_state.json": "Tracks the overall project state (version 15) for a Student Budget Manager mobile app, including architectural notes, existing features, and requirements covering budgeting, expense tracking, savings goals, digital locker, wallet payments, KYC, and admin controls."
}