{
  "backend/main.mo": "Main Motoko actor defining all data types (Profile, Wallet, Expense, SavingsGoal, etc.), state management, and public API endpoints for a student budget manager app with access control, income tracking, expense logging, savings goals, digital locker, and wallet fund transfers.",
  "backend/migration.mo": "Migration module that transforms old actor state by renaming `senderLabel` to `recipientLabel` and adding a `transactionType` field to wallet transactions, preserving all other profile and wallet data.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (QR code generation, QR scanner with send-money flow, and wallet UI redesign) to their source files, component dependencies, and test IDs.",
  "frontend-file-summaries.txt": "Auto-generated JSON document summarizing each frontend source file's purpose, covering components, hooks, utilities, and styles for the student budget manager React app.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH CSS custom properties for light and dark themes, covering background, foreground, card, primary, chart, and sidebar color tokens.",
  "frontend/index.html": "Minimal HTML entry point for the React app titled 'Student Budget Manager', mounting the app at `#root` and loading `src/main.tsx` as a module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with seven routes (home, onboarding, expenses, goals, invest, calculator, wallet), authentication guards redirecting unauthenticated or unprovisioned users, and wraps the app in ThemeProvider and Toaster.",
  "frontend/src/components/BalanceCard.tsx": "A reusable card component that displays a financial balance (spending, saving, or investing) with a gradient background, icon, optional lock status badge, and INR-formatted amount.",
  "frontend/src/components/BottomNavigation.tsx": "A fixed bottom navigation bar with six tabs (Home, Expenses, Goals, Wallet, Invest, Calc) that highlights the active route using TanStack Router.",
  "frontend/src/components/BudgetCalculator.tsx": "An interactive budget calculator component with income input and sliders to split income into spending, saving, and investing percentages, showing INR amounts per category without persisting data.",
  "frontend/src/components/Dashboard.tsx": "The main dashboard view that fetches user profile, locker status, and wallet balance to display balance cards, recent expenses, and budget summary, with loading skeletons and an onboarding prompt if no income is set.",
  "frontend/src/components/ExpenseTracker.tsx": "An expense tracking page that lets users add categorized expenses via a form, displays a monthly budget progress bar, and lists expenses grouped by date.",
  "frontend/src/components/GoalCard.tsx": "A card component for a single savings goal showing progress, deadline, top-up form, and an unlock button that calls the backend to check if the goal condition is met.",
  "frontend/src/components/InvestmentCard.tsx": "A display card for an investment option showing its name, risk level, annual return range, minimum monthly amount, and the user's current monthly allocation if set.",
  "frontend/src/components/InvestmentSuggestions.tsx": "Displays investment suggestions (RD, PPF, Index Fund) for students with a monthly investment banner, investment cards, and growth projection tables based on the user's profile allocation.",
  "frontend/src/components/Layout.tsx": "Wraps app pages with a consistent layout including a bottom navigation bar that only appears when the user is authenticated via Internet Identity.",
  "frontend/src/components/LoginPage.tsx": "Renders the login/landing page with feature highlights and an Internet Identity login button for new and returning users.",
  "frontend/src/components/OnboardingScreen.tsx": "Multi-step onboarding form that collects income sources (pocket money, stipend, part-time) and budget allocation sliders, then saves the profile and redirects to the dashboard.",
  "frontend/src/components/ProfileSetup.tsx": "Simple form component that prompts a newly authenticated user to enter their display name and saves it via the backend mutation.",
  "frontend/src/components/ProjectionTable.tsx": "Renders a table showing 1-, 3-, and 5-year compound growth projections for a given monthly investment amount and annual return rate.",
  "frontend/src/components/QRScannerModal.tsx": "Full-screen modal that activates the device camera to scan QR codes using a custom hook, displaying a scan frame overlay and returning the decoded result via callback.",
  "frontend/src/components/ReceiveMoneyModal.tsx": "Modal that displays the user's payment ID as a QR code (fetched from an external API with a canvas fallback) along with copy and share actions.",
  "frontend/src/components/SavingsGoalTracker.tsx": "React component that displays savings goals, allows creating new goals via a form, and shows the digital locker lock/unlock status. Uses custom query hooks for data fetching and mutations.",
  "frontend/src/components/SendMoneyForm.tsx": "Modal dialog form for sending funds to a recipient, with fields for recipient, amount, and note, including balance validation and prefill support for QR-scanned recipients.",
  "frontend/src/components/TransactionListItem.tsx": "Presentational component that renders a single wallet transaction row with icon, label, amount, and badge styled according to the transaction type (received, sent, locker transfer).",
  "frontend/src/components/Wallet.tsx": "Main wallet page component displaying balance, grouped transaction history, and collapsible forms for adding funds and transferring to the digital locker, with QR scan and receive money modals.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login, logout, and identity persistence with status tracking for use throughout the app.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including user profile, income, allocation, expenses, savings goals, digital locker, and wallet transactions using TanStack Query's useQuery and useMutation.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, sets up Tailwind directives, and defines CSS custom properties for a teal/green-themed design system with light and dark mode variants plus reusable component utility classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/utils/dateGrouping.ts": "Utility that sorts and groups an array of Expense objects by date into labeled buckets (Today, Yesterday, or formatted date string) for display in the expense history UI.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that maps CSS custom properties to semantic color tokens (primary, card, sidebar, chart, etc.), sets a fixed 430px mobile container width, extends border radii, shadows, and defines accordion/slide animations.",
  "project_state.json": "Project state manifest describing the Student Budget Manager app's architecture, existing features, known issues, and versioned feature list used to track build progress."
}