{
  "backend/main.mo": "Main Motoko actor defining all data types (Profile, Wallet, KYC, Transactions) and backend logic for a student budget manager app, including access control, user profiles, expenses, savings goals, and wallet operations.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files, describing each component's purpose and recent changes such as wallet integration and admin panel additions.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom property tokens for light and dark themes, covering background, foreground, card, chart, and sidebar color variables.",
  "frontend/index.html": "Minimal HTML shell for the React app, mounting the app into a root div and loading the main TypeScript entry point as an ES module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with eight routes (dashboard, onboarding, expenses, goals, invest, calculator, wallet, admin), wrapping protected routes in an AuthGuard that handles Internet Identity login and profile setup.",
  "frontend/src/components/AdminPanel.tsx": "Admin-only panel that fetches and displays wallet system statistics (total users, balances, KYC counts) and a per-user summary table, with unauthorized access and loading states handled.",
  "frontend/src/components/BalanceCard.tsx": "Reusable gradient card component that displays a financial category title, INR-formatted amount, optional subtitle, lock status indicator, and decorative background elements.",
  "frontend/src/components/BottomNavigation.tsx": "Fixed bottom navigation bar with six tabs (Home, Expenses, Goals, Invest, Calc, Wallet) using TanStack Router for active-state highlighting and navigation.",
  "frontend/src/components/BudgetCalculator.tsx": "A standalone budget calculator component that lets users input monthly income and adjust spending/saving/investing percentages via sliders, displaying INR-formatted breakdowns and a daily spend estimate. No data is persisted.",
  "frontend/src/components/ComplianceNotice.tsx": "A collapsible legal/compliance notice component that displays disclaimers about the simulated wallet, RBI/PPI licensing, Aadhaar/KYC data handling, and age requirements.",
  "frontend/src/components/Dashboard.tsx": "The main dashboard component that fetches and displays the user's profile, wallet balance, locker status, income allocation, and recent expenses, with navigation to onboarding if no income is set up.",
  "frontend/src/components/ExpenseTracker.tsx": "An expense tracking component that displays grouped expenses by date, shows a spending budget progress bar, and provides a form to add new categorized expenses via the addExpense mutation.",
  "frontend/src/components/GoalCard.tsx": "A card component for an individual savings goal that shows progress toward a target amount, supports topping up the goal, and allows unlocking the goal when the target is met.",
  "frontend/src/components/InvestmentCard.tsx": "A presentational card component that displays details about an investment option including name, risk level, annual return range, minimum monthly amount, and the user's current monthly allocation.",
  "frontend/src/components/InvestmentSuggestions.tsx": "Displays investment suggestions (RD, PPF, Index Fund) for students with a monthly investment banner, investment cards, and growth projection tables based on the user's income and allocation profile.",
  "frontend/src/components/KYCFlow.tsx": "Renders a KYC verification flow with status badge, transaction limit info, and forms for submitting Basic KYC (name, DOB, phone, Aadhaar last 4) and Full KYC (address, photo ID).",
  "frontend/src/components/Layout.tsx": "Wraps app content in a full-screen container and conditionally renders the BottomNavigation when the user has an Internet Identity.",
  "frontend/src/components/LoginPage.tsx": "Landing/login page that showcases app features and provides an Internet Identity login button for new users.",
  "frontend/src/components/OnboardingScreen.tsx": "Multi-field onboarding form where users enter income sources (pocket money, stipend, part-time) and set spending/saving/investing allocation sliders, then saves the profile and redirects to the dashboard.",
  "frontend/src/components/PINPad.tsx": "A 4-digit PIN entry component with dot indicators, a numeric keypad grid, and a backspace button that calls onComplete when all 4 digits are entered.",
  "frontend/src/components/ProfileSetup.tsx": "Simple form that collects the user's display name and saves it via the saveCallerUserProfile mutation to initialize their profile.",
  "frontend/src/components/ProjectionTable.tsx": "Renders a table showing 1-, 3-, and 5-year investment growth projections given a monthly amount and annual return rate using compound interest (FV) calculations.",
  "frontend/src/components/QRScannerModal.tsx": "Empty file with no content.",
  "frontend/src/components/ReceiveMoneyModal.tsx": "Empty file with no content.",
  "frontend/src/components/SavingsGoalTracker.tsx": "React component that displays a list of savings goals and a form to create new ones, with digital locker status shown as a locked/unlocked indicator.",
  "frontend/src/components/SendMoneyForm.tsx": "Empty file with no content.",
  "frontend/src/components/TransactionListItem.tsx": "Empty file with no content.",
  "frontend/src/components/Wallet.tsx": "Full-featured wallet UI component supporting balance display, add/deduct funds, locker transfers, and grouped transaction history with PIN and KYC flows.",
  "frontend/src/components/WalletPINSetup.tsx": "Two-step PIN setup component that prompts the user to enter and confirm a 4-digit wallet PIN, then saves it via a mutation hook.",
  "frontend/src/components/WalletPINVerify.tsx": "PIN verification component that accepts a 4-digit input and calls the verify mutation, invoking a callback on success or showing an error on failure.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Centralized collection of React Query hooks (queries and mutations) for all backend interactions including profiles, expenses, savings goals, wallet operations, and KYC.",
  "frontend/src/index.css": "Global CSS file that imports fonts, sets up Tailwind directives, and defines a teal/green OKLCH-based design token system for both light and dark modes, plus reusable component utility classes.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/utils/dateGrouping.ts": "Utility that sorts expenses by descending date and groups them into labeled buckets (Today, Yesterday, or formatted date string) for display in the expense history.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL/hash query parameters, persisting them to sessionStorage, and cleaning sensitive params from the address bar without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that maps OKLCH CSS variables to semantic color tokens, constrains all breakpoints to 430px for a mobile-first layout, and adds custom shadows, border radii, and keyframe animations.",
  "project_state.json": "Project state manifest describing the Student Budget Manager app's architecture, existing features, known issues, and versioning metadata used to track build progress."
}