{
  "backend/main.mo": "Main Motoko actor implementing the Student Budget Manager backend with access control, user profile management, expense tracking, savings goals, digital locker, and wallet (balance, transactions, transfers, send funds) functionality.",
  "feature_evidence.json": "Feature evidence report documenting the removal of the 'Add Funds/Receive Money' form from Wallet.tsx, listing affected files, components, and test IDs with high confidence.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files, describing the purpose and key details of each component, hook, utility, and config file in the project.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark themes, covering background, foreground, card, border, chart, and sidebar color tokens.",
  "frontend/index.html": "Minimal HTML shell for the React app titled 'Student Budget Manager', mounting the app at #root and loading the Vite entry point.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with six routes, authentication/profile guards for dashboard and wallet routes, and wraps the app in ThemeProvider and Toaster.",
  "frontend/src/components/BalanceCard.tsx": "Reusable card component displaying a financial category title, INR-formatted amount, optional subtitle/badge, gradient background, and an optional lock/unlock status indicator.",
  "frontend/src/components/BottomNavigation.tsx": "Fixed bottom navigation bar with six tabs (Home, Expenses, Goals, Wallet, Invest, Calc) using TanStack Router for active-state highlighting and touch-friendly sizing.",
  "frontend/src/components/BudgetCalculator.tsx": "A standalone budget calculator component that lets users input monthly income and adjust spending/saving/investing percentages via sliders, displaying calculated amounts and a daily spend breakdown. No data is persisted.",
  "frontend/src/components/Dashboard.tsx": "Main dashboard component that displays a user's income summary, budget allocation amounts, wallet balance, locker status, and recent expenses, with loading skeletons and an onboarding prompt if no income is set up.",
  "frontend/src/components/ExpenseTracker.tsx": "Expense tracking component that shows a monthly budget usage progress bar, an inline form to add categorized expenses, and a date-grouped list of past expenses fetched from the backend.",
  "frontend/src/components/GoalCard.tsx": "Displays a single savings goal with progress bar, deadline countdown, lock status, a top-up form, and an unlock button that calls the backend to check if the goal condition is met.",
  "frontend/src/components/InvestmentCard.tsx": "Presentational card component that renders details for a single investment option including name, risk level, return range, minimum amount, and the user's monthly allocation if provided.",
  "frontend/src/components/InvestmentSuggestions.tsx": "Displays a list of static low-risk investment suggestions (RD, PPF, Index Fund SIP) alongside the user's monthly investment budget and a projection table, with a warning if no investment allocation is set.",
  "frontend/src/components/Layout.tsx": "Wrapper layout component that renders children inside a centered app container and conditionally shows the bottom navigation bar when the user is authenticated.",
  "frontend/src/components/LoginPage.tsx": "Renders the login landing page with a hero section, feature highlights, and an Internet Identity login button that shows a loading spinner while authenticating.",
  "frontend/src/components/OnboardingScreen.tsx": "Multi-step onboarding form where new users enter income sources (pocket money, stipend, part-time) and set spending/saving/investing allocation sliders, then submits to the backend and redirects to the dashboard.",
  "frontend/src/components/ProfileSetup.tsx": "Simple form that collects the user's display name and saves it via the saveCallerUserProfile mutation to complete initial profile creation.",
  "frontend/src/components/ProjectionTable.tsx": "Displays a 1/3/5-year compound interest growth projection table for a given monthly investment amount and annual return rate.",
  "frontend/src/components/QRScannerModal.tsx": "Full-screen modal that activates the device camera to scan QR codes using a custom hook, displaying a scan-frame overlay and emitting the decoded result via an onScan callback.",
  "frontend/src/components/ReceiveMoneyModal.tsx": "Dialog modal that shows the user's payment ID as a QR code (fetched from an external API with a canvas fallback) along with copy and native share buttons.",
  "frontend/src/components/SavingsGoalTracker.tsx": "Page component that lists savings goals, shows the digital locker status, and provides an inline form to create new goals with a name, target amount, optional deadline, and locker toggle.",
  "frontend/src/components/SendMoneyForm.tsx": "A modal dialog form component for sending money to a recipient, supporting prefilled recipient (e.g., from QR scan), amount validation against wallet balance, and submission via the useSendFundsFromWallet mutation.",
  "frontend/src/components/TransactionListItem.tsx": "A presentational component that renders a single wallet transaction row with an icon, label, timestamp, amount, and badge styled according to the transaction type (received, sent, locker transfer, etc.).",
  "frontend/src/components/Wallet.tsx": "The main Wallet page component displaying wallet balance, grouped transaction history, and action buttons for sending, receiving, QR scanning, and transferring funds to a Digital Locker.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing and invalidating dependent queries whenever the Internet Identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY AuthClient-based login, logout, and identity state (including persistence across page reloads) via React context.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks (queries and mutations) for interacting with the ICP backend, covering user profiles, income, allocation, expenses, savings goals, digital locker, and wallet operations.",
  "frontend/src/index.css": "Global CSS file that imports fonts, sets up Tailwind directives, and defines a teal/green OKLCH color palette with light/dark mode CSS variables plus reusable component utility classes.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/utils/dateGrouping.ts": "Utility that sorts expenses by descending date and groups them into labeled buckets (Today, Yesterday, or formatted date string) for display in the expense history.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters from both regular and hash-based routes, persisting them to sessionStorage, and cleaning sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that maps OKLCH CSS variables to semantic color tokens, constrains all breakpoints to 430px for a mobile-first layout, and adds custom fonts, shadows, border radii, and keyframe animations.",
  "project_state.json": "Project state manifest describing the Student Budget Manager app's architecture, known issues, and the full list of implemented features including onboarding, dashboard, expense tracker, savings goals, investments, digital locker, and wallet/QR payment screens."
}