{
  "backend/main.mo": "Main Motoko actor implementing a student budget manager backend with access-controlled endpoints for managing user profiles, income sources, budget allocations, expenses, savings goals, and a digital locker feature.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (onboarding, dashboard, expense tracker, savings goals, etc.) to their source files, components, and test requirement IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of every frontend source file, serving as a reference index for the project's React component and utility structure.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH CSS custom properties for light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "Minimal HTML entry point titled 'Student Budget Manager' that mounts the React app into a root div and loads the main TSX module.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with six routes, wraps the app in ThemeProvider and Toaster, and implements an auth/profile guard on the index route.",
  "frontend/src/components/BalanceCard.tsx": "Reusable gradient card component that displays a financial category title, INR-formatted amount, optional subtitle, lock status indicator, and decorative background circles.",
  "frontend/src/components/BottomNavigation.tsx": "Fixed bottom navigation bar with five tabs (Home, Expenses, Goals, Invest, Calculator) that highlights the active route and navigates via TanStack Router.",
  "frontend/src/components/BudgetCalculator.tsx": "A standalone budget calculator component that lets users input monthly income and adjust spending/saving/investing percentages via sliders, displaying calculated amounts and a daily spend breakdown. No data is persisted; all calculations are local state.",
  "frontend/src/components/Dashboard.tsx": "The main dashboard view that displays a user's income summary, budget allocation amounts, recent expenses, and locker status, with loading skeletons and a setup prompt for new users.",
  "frontend/src/components/ExpenseTracker.tsx": "An expense tracking page that shows a monthly budget progress bar and a date-grouped expense list, with an inline form to add new expenses by amount, category, and note.",
  "frontend/src/components/GoalCard.tsx": "A card component for a single savings goal that displays progress toward a target amount, supports topping up with additional funds, and allows unlocking the goal when the target is met.",
  "frontend/src/components/InvestmentCard.tsx": "A presentational card component that displays details for a single investment option including name, risk level, return range, minimum amount, and the user's monthly allocation if set.",
  "frontend/src/components/InvestmentSuggestions.tsx": "A page component that lists low-risk investment suggestions (RD, PPF, Index Fund SIP) with the user's monthly investment allocation and a growth projection table, prompting allocation setup if none exists.",
  "frontend/src/components/Layout.tsx": "A simple layout wrapper that renders children inside a centered app container and conditionally shows the bottom navigation bar when the user is authenticated.",
  "frontend/src/components/LoginPage.tsx": "Renders the app's login landing page with a hero section, feature highlights, and an Internet Identity login button that shows a loading spinner during authentication.",
  "frontend/src/components/OnboardingScreen.tsx": "Multi-step onboarding form where new users enter income sources (pocket money, stipend, part-time) and set spending/saving/investing allocation sliders, then submits the data to the backend before redirecting to the dashboard.",
  "frontend/src/components/ProfileSetup.tsx": "Simple form that collects the user's display name and saves it via the `useSaveCallerUserProfile` mutation to create their profile on first login.",
  "frontend/src/components/ProjectionTable.tsx": "Displays a 1/3/5-year compound growth projection table for a given monthly investment amount and annual return rate using future-value calculations.",
  "frontend/src/components/SavingsGoalTracker.tsx": "Lists savings goals with a digital locker status indicator and provides a form to create new goals with a name, target amount, optional deadline, and optional locker toggle.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an authenticated (or anonymous) ICP backend actor using TanStack Query, and invalidates all dependent queries whenever the actor instance changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` context and `useInternetIdentity` hook that manage DFINITY AuthClient lifecycle, login/logout flow, and expose identity state and status flags to the component tree.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for all backend interactions including user profile, income, allocation, expenses, savings goals, and digital locker CRUD operations using the actor pattern.",
  "frontend/src/index.css": "Global stylesheet defining Tailwind base/component/utility layers, CSS custom properties for a teal/green color palette (light and dark modes), and reusable component classes like card-base and gradient utilities.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/utils/dateGrouping.ts": "Utility that sorts expenses by descending date and groups them into labeled buckets (Today, Yesterday, or formatted date string) for display in the expense history UI.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with oklch-based design tokens, custom fonts, border radii, box shadows, animations, and a fixed 430px max-width container for mobile layout.",
  "project_state.json": "Project state manifest describing the Student Budget Manager app's architecture, existing features, image requirements, and versioning metadata for build planning."
}