{
  "kind": "build_request",
  "title": "Remove Add Funds feature from Wallet screen",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-18",
      "text": "Remove the 'Add Funds' / 'Receive Money' form section from the Wallet screen (frontend/src/components/Wallet.tsx) that allows users to manually enter an amount and sender label to simulate receiving money. The collapsible form, its trigger button, and any related state variables should be deleted. The wallet balance display, transaction history, Transfer to Locker section, QR code (Receive modal), and Scan & Pay functionality must remain untouched.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "remove the feature of adding funds"
        ]
      },
      "acceptanceCriteria": [
        "The Wallet screen no longer shows any 'Add Funds', 'Receive Money' form, or any input fields for entering an amount and sender label to add money.",
        "No button or UI element triggers an 'add funds' form on the Wallet screen.",
        "The addFundsToWallet mutation call is removed from the Wallet component.",
        "Wallet balance card, Transfer to Locker section, QR code Receive modal, Scan & Pay scanner modal, and transaction history list are all still present and functional.",
        "No TypeScript or build errors are introduced."
      ]
    },
    {
      "id": "REQ-19",
      "text": "Remove or disable the addFundsToWallet public function from the backend actor (backend/main.mo) since it will no longer be called from the frontend. If removing causes downstream type errors in other functions, stub it out with a deprecation comment instead.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "remove the feature of adding funds"
        ]
      },
      "acceptanceCriteria": [
        "The addFundsToWallet function is either removed or clearly marked as deprecated/no-op in backend/main.mo.",
        "All other backend functions (getWalletBalance, transferToLocker, getWalletTransactions, sendFundsFromWallet) continue to compile and behave correctly.",
        "No Motoko compilation errors are introduced."
      ]
    }
  ],
  "constraints": [
    "Do not remove or modify the QR code Receive modal (ReceiveMoneyModal), the Scan & Pay scanner modal (QRScannerModal), or the SendMoneyForm component.",
    "Do not alter the Transfer to Locker section or its backend function.",
    "Do not modify any immutable frontend paths (hooks, main.tsx, ui components)."
  ],
  "nonGoals": [
    "Redesigning the Wallet screen layout beyond removing the Add Funds section.",
    "Removing or modifying the wallet balance display.",
    "Changing the transaction history or its grouping logic.",
    "Modifying any other screen or component outside the Wallet."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}