{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove Add Funds feature from Wallet screen",
  "requirements": [
    {
      "id": "REQ-18",
      "summary": "Remove the 'Add Funds' / 'Receive Money' form section from the Wallet screen, including the collapsible form, trigger button, and related state variables, while keeping all other wallet features intact",
      "acceptanceCriteria": [
        "The Wallet screen no longer shows any 'Add Funds', 'Receive Money' form, or any input fields for entering an amount and sender label to add money.",
        "No button or UI element triggers an 'add funds' form on the Wallet screen.",
        "The addFundsToWallet mutation call is removed from the Wallet component.",
        "Wallet balance card, Transfer to Locker section, QR code Receive modal, Scan & Pay scanner modal, and transaction history list are all still present and functional.",
        "No TypeScript or build errors are introduced."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Wallet.tsx",
          "operation": "modify",
          "description": "Remove the entire 'Add Funds' / 'Receive Money' collapsible form section including: (1) the state variable controlling the form visibility (e.g., showAddFunds or similar), (2) the CollapsibleTrigger button that opens the add funds form, (3) the CollapsibleContent wrapper containing the input fields for amount and sender label, (4) the submit handler that calls addFundsToWallet mutation, and (5) any imports related solely to the add funds form (e.g., useAddFundsToWallet if not used elsewhere). Ensure the Wallet balance card, Transfer to Locker section with its form, ReceiveMoneyModal (QR code), QRScannerModal (Scan & Pay), SendMoneyForm, and the grouped transaction history list remain untouched and fully functional."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Remove the useAddFundsToWallet mutation hook (or equivalent mutation hook for adding funds to the wallet) since it is no longer called from the Wallet component. Keep all other query and mutation hooks (useGetWalletBalance, useTransferToLocker, useGetWalletTransactions, useSendFundsFromWallet, etc.) intact."
        }
      ]
    }
  ]
}